#Напишите программу, которая найдёт произведение пар чисел списка.
# Парой считаем первый и последний элемент, второй и предпоследний и т.д.

#Пример:
#- [2, 3, 4, 5, 6] => [12, 15, 16];
#- [2, 3, 5, 6] => [12, 15]

def MulPair(li):
    res = []
    for i in range(0, int(len(li)/2) + len(li) % 2):
        res.append(li[i] * li[-(i+1)])
    return res

print(MulPair([2, 3, 4, 5, 6]))
print(MulPair([2, 3, 5, 6]))
